### Practice Questions for Data Cleaning & Wrangling:

**Missing Values**

Find how many missing values each column has.

Fill missing Age values with the median age.

Fill missing Embarked values with the most common port.

Drop rows where Cabin is missing.

**Data Standardization**

Standardize the Sex column so it only contains "male" or "female".

Remove leading/trailing spaces (if any) in all string columns.

**Duplicates**

Check if there are any duplicate rows.

Remove duplicates.

**Feature Engineering**

Create a new column FamilySize = SibSp + Parch + 1.

Create a new column Title by extracting from the Name column (e.g., Mr, Mrs, Miss, Dr, Master).

**Outliers**

Find passengers with extremely high Fare (above the 95th percentile).

Replace fares = 0 with the median fare.

**Encoding**

Convert Sex into numeric (0 = male, 1 = female).

Convert Embarked into dummy variables (pd.get_dummies).

**Grouping and Aggregation**

Find the average age and fare for each Pclass.

Find survival rate by Title.

In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv('messy_titanic.csv')

In [3]:
df.head()

,PassengerId,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Survived
0,1,"Smith, Mr. John",male,22.0,1,0,7.25,C85,S,0
1,2,"Doe, Mrs. Jane",female,38.0,1,0,71.83,NaN,C,1
2,3,"Brown, Miss. Emily",FEMALE,26.0,0,0,7.92,E46,S,1
3,4,"Taylor, Mr. Alex",Male,NaN,0,0,8.05,G6,S,1
4,5,"Johnson, Master. Tom",male,4.0,1,1,21.07,NaN,S,1

# Find how many missing values each column has.

In [4]:
df.isnull().sum()

PassengerId    0
Name           0
Sex            0
Age            4
SibSp          0
Parch          0
Fare           0
Cabin          7
Embarked       2
Survived       0
dtype: int64

# Fill missing Age values with the median age.

In [6]:
df['Age'] = df['Age'].fillna(df.Age.median())

In [7]:
df

,PassengerId,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Survived
0,1,"Smith, Mr. John",male,22.0,1,0,7.25,C85,S,0
1,2,"Doe, Mrs. Jane",female,38.0,1,0,71.83,NaN,C,1
2,3,"Brown, Miss. Emily",FEMALE,26.0,0,0,7.92,E46,S,1
3,4,"Taylor, Mr. Alex",Male,29.0,0,0,8.05,G6,S,1
4,5,"Johnson, Master. Tom",male,4.0,1,1,21.07,NaN,S,1
5,6,"Williams, Dr. Sarah",Female,35.0,1,0,8.46,C123,Q,0
6,7,"Jones, Mr. Robert",male,29.0,0,0,0.00,NaN,S,0
7,8,"Miller, Mrs. Anna",female,58.0,0,1,26.55,B28,NaN,1
8,9,"Davis, Miss. Kate",Female,14.0,0,0,8.05,NaN,S,0
9,10,"Garcia, Mr. Juan",male,28.0,1,0,31.28,C23,C,1
10,11,"Martinez, Mr. Carlos",male,19.0,0,0,7.88,D56,Q,0
11,12,"Rodriguez, Mrs. Maria",Female,29.0,1,2,263.00,C123,S,1
12,13,"Wilson, Miss. Lucy",FEMALE,31.0,0,0,7.75,NaN,S,1
13,14,"Anderson, Mr. Mark",male,45.0,0,0,8.05,E44,C,0
14,15,"Thomas, Mr. Paul",male,39.0,1,0,13.00,NaN,S,0
15,16,"Jackson, Mrs. Emma",female,27.0,1,1,55.00,B35,Q,1
16,17,"White, Mr. James",MALE,2.0,0,1,120.00,C85,S,1
17,18,"Harris, Miss. Sophia",female,30.0,0,0,7.25,NaN,NaN,0
18,19,"Martin, Dr. David",Male,54.0,0,0,8.05,A10,S,0
19,20,"Thompson, Mr. Daniel",male,29.0,1,0,0.00,C23,C,0
20,6,"Williams, Dr. Sarah",Female,35.0,1,0,8.46,C123,Q,0
21,11,"Martinez, Mr. Carlos",male,19.0,0,0,7.88,D56,Q,0

# Fill missing Embarked values with the most common port.

In [9]:
mode= df.Embarked.mode()
df['Embarked']= df['Embarked'].fillna(mode)

# Drop rows where Cabin is missing.

In [11]:
df.dropna(subset=['Cabin'])

,PassengerId,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Survived
0,1,"Smith, Mr. John",male,22.0,1,0,7.25,C85,S,0
2,3,"Brown, Miss. Emily",FEMALE,26.0,0,0,7.92,E46,S,1
3,4,"Taylor, Mr. Alex",Male,29.0,0,0,8.05,G6,S,1
5,6,"Williams, Dr. Sarah",Female,35.0,1,0,8.46,C123,Q,0
7,8,"Miller, Mrs. Anna",female,58.0,0,1,26.55,B28,NaN,1
9,10,"Garcia, Mr. Juan",male,28.0,1,0,31.28,C23,C,1
10,11,"Martinez, Mr. Carlos",male,19.0,0,0,7.88,D56,Q,0
11,12,"Rodriguez, Mrs. Maria",Female,29.0,1,2,263.00,C123,S,1
13,14,"Anderson, Mr. Mark",male,45.0,0,0,8.05,E44,C,0
15,16,"Jackson, Mrs. Emma",female,27.0,1,1,55.00,B35,Q,1
16,17,"White, Mr. James",MALE,2.0,0,1,120.00,C85,S,1
18,19,"Martin, Dr. David",Male,54.0,0,0,8.05,A10,S,0
19,20,"Thompson, Mr. Daniel",male,29.0,1,0,0.00,C23,C,0
20,6,"Williams, Dr. Sarah",Female,35.0,1,0,8.46,C123,Q,0
21,11,"Martinez, Mr. Carlos",male,19.0,0,0,7.88,D56,Q,0

In [12]:
df

,PassengerId,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Survived
0,1,"Smith, Mr. John",male,22.0,1,0,7.25,C85,S,0
1,2,"Doe, Mrs. Jane",female,38.0,1,0,71.83,NaN,C,1
2,3,"Brown, Miss. Emily",FEMALE,26.0,0,0,7.92,E46,S,1
3,4,"Taylor, Mr. Alex",Male,29.0,0,0,8.05,G6,S,1
4,5,"Johnson, Master. Tom",male,4.0,1,1,21.07,NaN,S,1
5,6,"Williams, Dr. Sarah",Female,35.0,1,0,8.46,C123,Q,0
6,7,"Jones, Mr. Robert",male,29.0,0,0,0.00,NaN,S,0
7,8,"Miller, Mrs. Anna",female,58.0,0,1,26.55,B28,NaN,1
8,9,"Davis, Miss. Kate",Female,14.0,0,0,8.05,NaN,S,0
9,10,"Garcia, Mr. Juan",male,28.0,1,0,31.28,C23,C,1
10,11,"Martinez, Mr. Carlos",male,19.0,0,0,7.88,D56,Q,0
11,12,"Rodriguez, Mrs. Maria",Female,29.0,1,2,263.00,C123,S,1
12,13,"Wilson, Miss. Lucy",FEMALE,31.0,0,0,7.75,NaN,S,1
13,14,"Anderson, Mr. Mark",male,45.0,0,0,8.05,E44,C,0
14,15,"Thomas, Mr. Paul",male,39.0,1,0,13.00,NaN,S,0
15,16,"Jackson, Mrs. Emma",female,27.0,1,1,55.00,B35,Q,1
16,17,"White, Mr. James",MALE,2.0,0,1,120.00,C85,S,1
17,18,"Harris, Miss. Sophia",female,30.0,0,0,7.25,NaN,NaN,0
18,19,"Martin, Dr. David",Male,54.0,0,0,8.05,A10,S,0
19,20,"Thompson, Mr. Daniel",male,29.0,1,0,0.00,C23,C,0
20,6,"Williams, Dr. Sarah",Female,35.0,1,0,8.46,C123,Q,0
21,11,"Martinez, Mr. Carlos",male,19.0,0,0,7.88,D56,Q,0

# Standardize the Sex column so it only contains "male" or "female".

In [13]:
df['Sex']= df.Sex.str.strip().str.capitalize()

In [14]:
df

,PassengerId,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Survived
0,1,"Smith, Mr. John",Male,22.0,1,0,7.25,C85,S,0
1,2,"Doe, Mrs. Jane",Female,38.0,1,0,71.83,NaN,C,1
2,3,"Brown, Miss. Emily",Female,26.0,0,0,7.92,E46,S,1
3,4,"Taylor, Mr. Alex",Male,29.0,0,0,8.05,G6,S,1
4,5,"Johnson, Master. Tom",Male,4.0,1,1,21.07,NaN,S,1
5,6,"Williams, Dr. Sarah",Female,35.0,1,0,8.46,C123,Q,0
6,7,"Jones, Mr. Robert",Male,29.0,0,0,0.00,NaN,S,0
7,8,"Miller, Mrs. Anna",Female,58.0,0,1,26.55,B28,NaN,1
8,9,"Davis, Miss. Kate",Female,14.0,0,0,8.05,NaN,S,0
9,10,"Garcia, Mr. Juan",Male,28.0,1,0,31.28,C23,C,1
10,11,"Martinez, Mr. Carlos",Male,19.0,0,0,7.88,D56,Q,0
11,12,"Rodriguez, Mrs. Maria",Female,29.0,1,2,263.00,C123,S,1
12,13,"Wilson, Miss. Lucy",Female,31.0,0,0,7.75,NaN,S,1
13,14,"Anderson, Mr. Mark",Male,45.0,0,0,8.05,E44,C,0
14,15,"Thomas, Mr. Paul",Male,39.0,1,0,13.00,NaN,S,0
15,16,"Jackson, Mrs. Emma",Female,27.0,1,1,55.00,B35,Q,1
16,17,"White, Mr. James",Male,2.0,0,1,120.00,C85,S,1
17,18,"Harris, Miss. Sophia",Female,30.0,0,0,7.25,NaN,NaN,0
18,19,"Martin, Dr. David",Male,54.0,0,0,8.05,A10,S,0
19,20,"Thompson, Mr. Daniel",Male,29.0,1,0,0.00,C23,C,0
20,6,"Williams, Dr. Sarah",Female,35.0,1,0,8.46,C123,Q,0
21,11,"Martinez, Mr. Carlos",Male,19.0,0,0,7.88,D56,Q,0

# Remove leading/trailing spaces (if any) in all string columns.

In [40]:
df.apply(lambda x: x.str.strip() if x.dtype==object else x)

,PassengerId,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Survived,FamilySize,title
0,1,"Smith, Mr. John",0,22.0,1,0,7.25,C85,S,0,2,Mr
1,2,"Doe, Mrs. Jane",1,38.0,1,0,71.83,NaN,C,1,2,Mrs
2,3,"Brown, Miss. Emily",1,26.0,0,0,7.92,E46,S,1,1,Miss
3,4,"Taylor, Mr. Alex",0,29.0,0,0,8.05,G6,S,1,1,Mr
4,5,"Johnson, Master. Tom",0,4.0,1,1,21.07,NaN,S,1,3,Master
5,6,"Williams, Dr. Sarah",1,35.0,1,0,8.46,C123,Q,0,2,Dr
6,7,"Jones, Mr. Robert",0,29.0,0,0,8.05,NaN,S,0,1,Mr
7,8,"Miller, Mrs. Anna",1,58.0,0,1,26.55,B28,NaN,1,2,Mrs
8,9,"Davis, Miss. Kate",1,14.0,0,0,8.05,NaN,S,0,1,Miss
9,10,"Garcia, Mr. Juan",0,28.0,1,0,31.28,C23,C,1,2,Mr
10,11,"Martinez, Mr. Carlos",0,19.0,0,0,7.88,D56,Q,0,1,Mr
11,12,"Rodriguez, Mrs. Maria",1,29.0,1,2,263.00,C123,S,1,4,Mrs
12,13,"Wilson, Miss. Lucy",1,31.0,0,0,7.75,NaN,S,1,1,Miss
13,14,"Anderson, Mr. Mark",0,45.0,0,0,8.05,E44,C,0,1,Mr
14,15,"Thomas, Mr. Paul",0,39.0,1,0,13.00,NaN,S,0,2,Mr
15,16,"Jackson, Mrs. Emma",1,27.0,1,1,55.00,B35,Q,1,3,Mrs
16,17,"White, Mr. James",0,2.0,0,1,120.00,C85,S,1,2,Mr
17,18,"Harris, Miss. Sophia",1,30.0,0,0,7.25,NaN,NaN,0,1,Miss
18,19,"Martin, Dr. David",0,54.0,0,0,8.05,A10,S,0,1,Dr
19,20,"Thompson, Mr. Daniel",0,29.0,1,0,8.05,C23,C,0,2,Mr
20,6,"Williams, Dr. Sarah",1,35.0,1,0,8.46,C123,Q,0,2,Dr
21,11,"Martinez, Mr. Carlos",0,19.0,0,0,7.88,D56,Q,0,1,Mr

# Check if there are any duplicate rows.

In [17]:
df.duplicated().sum()

2

# Remove duplicates.

In [20]:
df.drop_duplicates(keep='first')

,PassengerId,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Survived
0,1,"Smith, Mr. John",Male,22.0,1,0,7.25,C85,S,0
1,2,"Doe, Mrs. Jane",Female,38.0,1,0,71.83,NaN,C,1
2,3,"Brown, Miss. Emily",Female,26.0,0,0,7.92,E46,S,1
3,4,"Taylor, Mr. Alex",Male,29.0,0,0,8.05,G6,S,1
4,5,"Johnson, Master. Tom",Male,4.0,1,1,21.07,NaN,S,1
5,6,"Williams, Dr. Sarah",Female,35.0,1,0,8.46,C123,Q,0
6,7,"Jones, Mr. Robert",Male,29.0,0,0,0.00,NaN,S,0
7,8,"Miller, Mrs. Anna",Female,58.0,0,1,26.55,B28,NaN,1
8,9,"Davis, Miss. Kate",Female,14.0,0,0,8.05,NaN,S,0
9,10,"Garcia, Mr. Juan",Male,28.0,1,0,31.28,C23,C,1
10,11,"Martinez, Mr. Carlos",Male,19.0,0,0,7.88,D56,Q,0
11,12,"Rodriguez, Mrs. Maria",Female,29.0,1,2,263.00,C123,S,1
12,13,"Wilson, Miss. Lucy",Female,31.0,0,0,7.75,NaN,S,1
13,14,"Anderson, Mr. Mark",Male,45.0,0,0,8.05,E44,C,0
14,15,"Thomas, Mr. Paul",Male,39.0,1,0,13.00,NaN,S,0
15,16,"Jackson, Mrs. Emma",Female,27.0,1,1,55.00,B35,Q,1
16,17,"White, Mr. James",Male,2.0,0,1,120.00,C85,S,1
17,18,"Harris, Miss. Sophia",Female,30.0,0,0,7.25,NaN,NaN,0
18,19,"Martin, Dr. David",Male,54.0,0,0,8.05,A10,S,0
19,20,"Thompson, Mr. Daniel",Male,29.0,1,0,0.00,C23,C,0

# Create a new column FamilySize = SibSp + Parch + 1.

In [21]:
df['FamilySize']=df['SibSp']+df['Parch']+1

In [22]:
df

,PassengerId,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Survived,FamilySize
0,1,"Smith, Mr. John",Male,22.0,1,0,7.25,C85,S,0,2
1,2,"Doe, Mrs. Jane",Female,38.0,1,0,71.83,NaN,C,1,2
2,3,"Brown, Miss. Emily",Female,26.0,0,0,7.92,E46,S,1,1
3,4,"Taylor, Mr. Alex",Male,29.0,0,0,8.05,G6,S,1,1
4,5,"Johnson, Master. Tom",Male,4.0,1,1,21.07,NaN,S,1,3
5,6,"Williams, Dr. Sarah",Female,35.0,1,0,8.46,C123,Q,0,2
6,7,"Jones, Mr. Robert",Male,29.0,0,0,0.00,NaN,S,0,1
7,8,"Miller, Mrs. Anna",Female,58.0,0,1,26.55,B28,NaN,1,2
8,9,"Davis, Miss. Kate",Female,14.0,0,0,8.05,NaN,S,0,1
9,10,"Garcia, Mr. Juan",Male,28.0,1,0,31.28,C23,C,1,2
10,11,"Martinez, Mr. Carlos",Male,19.0,0,0,7.88,D56,Q,0,1
11,12,"Rodriguez, Mrs. Maria",Female,29.0,1,2,263.00,C123,S,1,4
12,13,"Wilson, Miss. Lucy",Female,31.0,0,0,7.75,NaN,S,1,1
13,14,"Anderson, Mr. Mark",Male,45.0,0,0,8.05,E44,C,0,1
14,15,"Thomas, Mr. Paul",Male,39.0,1,0,13.00,NaN,S,0,2
15,16,"Jackson, Mrs. Emma",Female,27.0,1,1,55.00,B35,Q,1,3
16,17,"White, Mr. James",Male,2.0,0,1,120.00,C85,S,1,2
17,18,"Harris, Miss. Sophia",Female,30.0,0,0,7.25,NaN,NaN,0,1
18,19,"Martin, Dr. David",Male,54.0,0,0,8.05,A10,S,0,1
19,20,"Thompson, Mr. Daniel",Male,29.0,1,0,0.00,C23,C,0,2
20,6,"Williams, Dr. Sarah",Female,35.0,1,0,8.46,C123,Q,0,2
21,11,"Martinez, Mr. Carlos",Male,19.0,0,0,7.88,D56,Q,0,1

# Create a new column Title by extracting from the Name column (e.g., Mr, Mrs, Miss, Dr, Master).

In [23]:
df['title']= df.Name.str.extract(r',\s*([^.]+).')

In [24]:
df

,PassengerId,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Survived,FamilySize,title
0,1,"Smith, Mr. John",Male,22.0,1,0,7.25,C85,S,0,2,Mr
1,2,"Doe, Mrs. Jane",Female,38.0,1,0,71.83,NaN,C,1,2,Mrs
2,3,"Brown, Miss. Emily",Female,26.0,0,0,7.92,E46,S,1,1,Miss
3,4,"Taylor, Mr. Alex",Male,29.0,0,0,8.05,G6,S,1,1,Mr
4,5,"Johnson, Master. Tom",Male,4.0,1,1,21.07,NaN,S,1,3,Master
5,6,"Williams, Dr. Sarah",Female,35.0,1,0,8.46,C123,Q,0,2,Dr
6,7,"Jones, Mr. Robert",Male,29.0,0,0,0.00,NaN,S,0,1,Mr
7,8,"Miller, Mrs. Anna",Female,58.0,0,1,26.55,B28,NaN,1,2,Mrs
8,9,"Davis, Miss. Kate",Female,14.0,0,0,8.05,NaN,S,0,1,Miss
9,10,"Garcia, Mr. Juan",Male,28.0,1,0,31.28,C23,C,1,2,Mr
10,11,"Martinez, Mr. Carlos",Male,19.0,0,0,7.88,D56,Q,0,1,Mr
11,12,"Rodriguez, Mrs. Maria",Female,29.0,1,2,263.00,C123,S,1,4,Mrs
12,13,"Wilson, Miss. Lucy",Female,31.0,0,0,7.75,NaN,S,1,1,Miss
13,14,"Anderson, Mr. Mark",Male,45.0,0,0,8.05,E44,C,0,1,Mr
14,15,"Thomas, Mr. Paul",Male,39.0,1,0,13.00,NaN,S,0,2,Mr
15,16,"Jackson, Mrs. Emma",Female,27.0,1,1,55.00,B35,Q,1,3,Mrs
16,17,"White, Mr. James",Male,2.0,0,1,120.00,C85,S,1,2,Mr
17,18,"Harris, Miss. Sophia",Female,30.0,0,0,7.25,NaN,NaN,0,1,Miss
18,19,"Martin, Dr. David",Male,54.0,0,0,8.05,A10,S,0,1,Dr
19,20,"Thompson, Mr. Daniel",Male,29.0,1,0,0.00,C23,C,0,2,Mr
20,6,"Williams, Dr. Sarah",Female,35.0,1,0,8.46,C123,Q,0,2,Dr
21,11,"Martinez, Mr. Carlos",Male,19.0,0,0,7.88,D56,Q,0,1,Mr

# Find passengers with extremely high Fare (above the 95th percentile).

In [26]:
perc= np.percentile(df.Fare, 95)
df.loc[df.Fare>perc]

,PassengerId,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Survived,FamilySize,title
11,12,"Rodriguez, Mrs. Maria",Female,29.0,1,2,263.0,C123,S,1,4,Mrs
16,17,"White, Mr. James",Male,2.0,0,1,120.0,C85,S,1,2,Mr

# Replace fares = 0 with the median fare.

In [28]:
median=df.Fare.median()
df.loc[df.Fare==0, "Fare"]=median

In [29]:
df

,PassengerId,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Survived,FamilySize,title
0,1,"Smith, Mr. John",Male,22.0,1,0,7.25,C85,S,0,2,Mr
1,2,"Doe, Mrs. Jane",Female,38.0,1,0,71.83,NaN,C,1,2,Mrs
2,3,"Brown, Miss. Emily",Female,26.0,0,0,7.92,E46,S,1,1,Miss
3,4,"Taylor, Mr. Alex",Male,29.0,0,0,8.05,G6,S,1,1,Mr
4,5,"Johnson, Master. Tom",Male,4.0,1,1,21.07,NaN,S,1,3,Master
5,6,"Williams, Dr. Sarah",Female,35.0,1,0,8.46,C123,Q,0,2,Dr
6,7,"Jones, Mr. Robert",Male,29.0,0,0,8.05,NaN,S,0,1,Mr
7,8,"Miller, Mrs. Anna",Female,58.0,0,1,26.55,B28,NaN,1,2,Mrs
8,9,"Davis, Miss. Kate",Female,14.0,0,0,8.05,NaN,S,0,1,Miss
9,10,"Garcia, Mr. Juan",Male,28.0,1,0,31.28,C23,C,1,2,Mr
10,11,"Martinez, Mr. Carlos",Male,19.0,0,0,7.88,D56,Q,0,1,Mr
11,12,"Rodriguez, Mrs. Maria",Female,29.0,1,2,263.00,C123,S,1,4,Mrs
12,13,"Wilson, Miss. Lucy",Female,31.0,0,0,7.75,NaN,S,1,1,Miss
13,14,"Anderson, Mr. Mark",Male,45.0,0,0,8.05,E44,C,0,1,Mr
14,15,"Thomas, Mr. Paul",Male,39.0,1,0,13.00,NaN,S,0,2,Mr
15,16,"Jackson, Mrs. Emma",Female,27.0,1,1,55.00,B35,Q,1,3,Mrs
16,17,"White, Mr. James",Male,2.0,0,1,120.00,C85,S,1,2,Mr
17,18,"Harris, Miss. Sophia",Female,30.0,0,0,7.25,NaN,NaN,0,1,Miss
18,19,"Martin, Dr. David",Male,54.0,0,0,8.05,A10,S,0,1,Dr
19,20,"Thompson, Mr. Daniel",Male,29.0,1,0,8.05,C23,C,0,2,Mr
20,6,"Williams, Dr. Sarah",Female,35.0,1,0,8.46,C123,Q,0,2,Dr
21,11,"Martinez, Mr. Carlos",Male,19.0,0,0,7.88,D56,Q,0,1,Mr

# Convert Sex into numeric (0 = male, 1 = female).

In [31]:
df['Sex']= df.Sex.apply(lambda x: 0 if x=='Male' else 1)

In [32]:
df

,PassengerId,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Survived,FamilySize,title
0,1,"Smith, Mr. John",0,22.0,1,0,7.25,C85,S,0,2,Mr
1,2,"Doe, Mrs. Jane",1,38.0,1,0,71.83,NaN,C,1,2,Mrs
2,3,"Brown, Miss. Emily",1,26.0,0,0,7.92,E46,S,1,1,Miss
3,4,"Taylor, Mr. Alex",0,29.0,0,0,8.05,G6,S,1,1,Mr
4,5,"Johnson, Master. Tom",0,4.0,1,1,21.07,NaN,S,1,3,Master
5,6,"Williams, Dr. Sarah",1,35.0,1,0,8.46,C123,Q,0,2,Dr
6,7,"Jones, Mr. Robert",0,29.0,0,0,8.05,NaN,S,0,1,Mr
7,8,"Miller, Mrs. Anna",1,58.0,0,1,26.55,B28,NaN,1,2,Mrs
8,9,"Davis, Miss. Kate",1,14.0,0,0,8.05,NaN,S,0,1,Miss
9,10,"Garcia, Mr. Juan",0,28.0,1,0,31.28,C23,C,1,2,Mr
10,11,"Martinez, Mr. Carlos",0,19.0,0,0,7.88,D56,Q,0,1,Mr
11,12,"Rodriguez, Mrs. Maria",1,29.0,1,2,263.00,C123,S,1,4,Mrs
12,13,"Wilson, Miss. Lucy",1,31.0,0,0,7.75,NaN,S,1,1,Miss
13,14,"Anderson, Mr. Mark",0,45.0,0,0,8.05,E44,C,0,1,Mr
14,15,"Thomas, Mr. Paul",0,39.0,1,0,13.00,NaN,S,0,2,Mr
15,16,"Jackson, Mrs. Emma",1,27.0,1,1,55.00,B35,Q,1,3,Mrs
16,17,"White, Mr. James",0,2.0,0,1,120.00,C85,S,1,2,Mr
17,18,"Harris, Miss. Sophia",1,30.0,0,0,7.25,NaN,NaN,0,1,Miss
18,19,"Martin, Dr. David",0,54.0,0,0,8.05,A10,S,0,1,Dr
19,20,"Thompson, Mr. Daniel",0,29.0,1,0,8.05,C23,C,0,2,Mr
20,6,"Williams, Dr. Sarah",1,35.0,1,0,8.46,C123,Q,0,2,Dr
21,11,"Martinez, Mr. Carlos",0,19.0,0,0,7.88,D56,Q,0,1,Mr

# Convert Embarked into dummy variables (pd.get_dummies).

In [33]:
help(pd.get_dummies)

Help on function get_dummies in module pandas.core.reshape.encoding:

get_dummies(data, prefix=None, prefix_sep: 'str | Iterable[str] | dict[str, str]' = '_', dummy_na: 'bool' = False, columns=None, sparse: 'bool' = False, drop_first: 'bool' = False, dtype: 'NpDtype | None' = None) -> 'DataFrame'
    Convert categorical variable into dummy/indicator variables.

    Each variable is converted in as many 0/1 variables as there are different
    values. Columns in the output are each named after a value; if the input is
    a DataFrame, the name of the original variable is prepended to the value.

    Parameters
    ----------
    data : array-like, Series, or DataFrame
        Data of which to get dummy indicators.
    prefix : str, list of str, or dict of str, default None
        String to append DataFrame column names.
        Pass a list with length equal to the number of columns
        when calling get_dummies on a DataFrame. Alternatively, `prefix`
        can be a dictionary mapping column names to prefixes.
    prefix_sep : str, default '_'
        If appending prefix, separator/delimiter to use. Or pass a
        list or dictionary as with `prefix`.
    dummy_na : bool, default False
        Add a column to indicate NaNs, if False NaNs are ignored.
    columns : list-like, default None
        Column names in the DataFrame to be encoded.
        If `columns` is None then all the columns with
        `object`, `string`, or `category` dtype will be converted.
    sparse : bool, default False
        Whether the dummy-encoded columns should be backed by
        a :class:`SparseArray` (True) or a regular NumPy array (False).
    drop_first : bool, default False
        Whether to get k-1 dummies out of k categorical levels by removing the
        first level.
    dtype : dtype, default bool
        Data type for new columns. Only a single dtype is allowed.

    Returns
    -------
    DataFrame
        Dummy-coded data. If `data` contains other columns than the
        dummy-coded one(s), these will be prepended, unaltered, to the result.

    See Also
    --------
    Series.str.get_dummies : Convert Series of strings to dummy codes.
    :func:`~pandas.from_dummies` : Convert dummy codes to categorical ``DataFrame``.

    Notes
    -----
    Reference :ref:`the user guide <reshaping.dummies>` for more examples.

    Examples
    --------
    >>> s = pd.Series(list('abca'))

    >>> pd.get_dummies(s)
           a      b      c
    0   True  False  False
    1  False   True  False
    2  False  False   True
    3   True  False  False

    >>> s1 = ['a', 'b', np.nan]

    >>> pd.get_dummies(s1)
           a      b
    0   True  False
    1  False   True
    2  False  False

    >>> pd.get_dummies(s1, dummy_na=True)
           a      b    NaN
    0   True  False  False
    1  False   True  False
    2  False  False   True

    >>> df = pd.DataFrame({'A': ['a', 'b', 'a'], 'B': ['b', 'a', 'c'],
    ...                    'C': [1, 2, 3]})

    >>> pd.get_dummies(df, prefix=['col1', 'col2'])
       C  col1_a  col1_b  col2_a  col2_b  col2_c
    0  1    True   False   False    True   False
    1  2   False    True    True   False   False
    2  3    True   False   False   False    True

    >>> pd.get_dummies(pd.Series(list('abcaa')))
           a      b      c
    0   True  False  False
    1  False   True  False
    2  False  False   True
    3   True  False  False
    4   True  False  False

    >>> pd.get_dummies(pd.Series(list('abcaa')), drop_first=True)
           b      c
    0  False  False
    1   True  False
    2  False   True
    3  False  False
    4  False  False

    >>> pd.get_dummies(pd.Series(list('abc')), dtype=float)
         a    b    c
    0  1.0  0.0  0.0
    1  0.0  1.0  0.0
    2  0.0  0.0  1.0

In [34]:
pd.get_dummies(df.Embarked)

        C      Q      S
0   False  False   True
1    True  False  False
2   False  False   True
3   False  False   True
4   False  False   True
5   False   True  False
6   False  False   True
7   False  False  False
8   False  False   True
9    True  False  False
10  False   True  False
11  False  False   True
12  False  False   True
13   True  False  False
14  False  False   True
15  False   True  False
16  False  False   True
17  False  False  False
18  False  False   True
19   True  False  False
20  False   True  False
21  False   True  False

# Find the average age and fare for each Pclass.

In [36]:
#df.groupby('Pclass').agg({"Age":"mean", "Fare":"mean"})

# Find survival rate by Title.

In [38]:
df.groupby('title').Survived.mean()*100

title
Dr          0.0
Master    100.0
Miss       50.0
Mr         30.0
Mrs       100.0
Name: Survived, dtype: float64

In [39]:
df.dtypes

PassengerId      int64
Name            object
Sex              int64
Age            float64
SibSp            int64
Parch            int64
Fare           float64
Cabin           object
Embarked        object
Survived         int64
FamilySize       int64
title           object
dtype: object